# !/usr/bin/python3.4

import json

CMDS = [
    {
     'rule': '^:get-energy \d\d\d[\da-fA-F][\dfF][\dfF]\d[\da-cA-C]$',
     'txFormat': {
        'slice': [2]*4,
        'order': [3, 1, 2, 0],
        'item': [
               {"00": "电能"
                },
               {"00": "组合有功", "01": "正向有功", "02": "反向有功",
                "03": "组合无功I", "04": "组合无功II", "05": "第一象限无功",
                "06": "第二象限无功", "07": "第三象限无功", "08": "第四象限无功",
                "09": "正向视在", "0A": "反向视在", "15": "A向正向有功",
                "16": "A相反向有功", "17": "A相组合无功I", "18": "A相组合无功II",
                "19": "A相第一象限无功", "1A": "A相第二象限无功",
                "1B": "A相第三象限无功", "1C": "A相第四象限无功",
                "1D": "A相正向视在", "1E": "A相反向视在", "29": "B相正向有功",
                "2A": "B相反向有功", "2B": "B相组合无功I", "2C": "B相组合无功II",
                "2D": "B相第一象限无功", "2E": "B相第二象限无功",
                "2F": "B相第三象限无功","30": "B相第四象限无功",
                "31": "B相正向视在", "32": "B相反向视在", "3D": "C相正向有功",
                "3E": "C相反向有功", "3F": "C相组合无功I", "40": "C相组合无功II",
                "41": "C相第一象限无功", "42": "C相第二象限无功",
                "43": "C相第三象限无功","44": "C相第四象限无功",
                "45": "C相正向视在", "46": "C相反向视在"
                },
               {"00": "总", "01": "费率1", "02": "费率2", "03": "费率3",
                "04": "费率4", "05": "费率5", "06": "费率6", "07": "费率7",
                "08": "费率8", "FF": "数据块"
                },
               {"00": "(当前)","01": "(上1结算日)","02": "(上2结算日)",
                "03": "(上3结算日)", "04": "(上4结算日)","05": "(上5结算日)",
                "06": "(上6结算日)", "07": "(上7结算日)", "08": "(上8结算日)",
                "09": "(上9结算日)", "0A": "(上10结算日)", "0B": "(上11结算日)",
                "0C": "(上12结算日)"
                },
               ]
                 }
     'rxFormat': {
        'unit': [8],
        'style': ""
     }
    },
    {
     'rule': '^:get-time$',
     'id': "04000102",
     'txFormat': "抄读时间(hhmmss)"
    },
    {
     'rule': '^:get-load-curve \d{8}( add-(\d)+)?$',
     'txFormat': {
        'slice': [2]*4,
        'order': [0, 1, 2, 3],
        'item': [
                {"06": "负荷曲线: "
                },
                {"00": "", "01": "第1类负荷", "02": "第2类负荷",
                 "03": "第3类负荷", "04": "第4类负荷", "05": "第5类负荷",
                 "06": "第6类负荷"
                },
                {"00": ""
                },
                {"00": "最早记录块", "01": "给定时间记录块",
                "02": "最近一个记录块"
                }
               ]
               }
    },
    {
     'rule': '^:set-time (\d\d){3}$',
     'id': "04000102",
     'code': '14',
     'len': '0F',
     'txFormat': "设置时间(hhmmss)"
    },
    {
     'rule': '^:set-date (\d\d){4}$',
     'id': "04000101",
     'code': '14',
     'len': '10',
     'txFormat': "设置日期及星期(YYMMDDWW)"
    },
]
