import time

psend(":get-addr")
for i in range(20):
  # 跳闸
  print("跳闸")
  psend("68 11 11 11 11 11 11 68 1C 10 36 44 44 44 34 33 33 33 4D 33 33 33 54 48 39 49 35 16")
  time.sleep(10)
  # 合闸允许
  print("合闸允许")
  psend("68 11 11 11 11 11 11 68 1C 10 36 44 44 44 34 33 33 33 4E 33 33 33 54 48 39 49 36 16")
  time.sleep(10)
  # 跳闸
  print("跳闸")
  psend("68 11 11 11 11 11 11 68 1C 10 36 44 44 44 34 33 33 33 4D 33 33 33 54 48 39 49 35 16")
  time.sleep(10)
  # 直接合闸
  print("直接合闸")
  psend("68 11 11 11 11 11 11 68 1C 10 36 44 44 44 34 33 33 33 4F 33 33 33 54 48 39 49 37 16")
  time.sleep(10)
  
  print("循环次数 %s" % i)



